# SheetBackgroundColor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellStyle..::..SheetBackgroundColor Property
TableCellStyle Class See Also
---
The background color of this cell in the sheet view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Color SheetBackgroundColor { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SheetBackgroundColor As Color
	Get
```

Visual C++
---
```text
public:
property Color^ SheetBackgroundColor {
	Color^ get ();
}
```

# Remarks
In most cases the background color on the sheet view is the same as it is in the grid view. The background may be different if conditional formatting is applied only in the grid view.
# See Also
TableCellStyle Class
Autodesk.Revit.DB Namespace